/* No comment provided by engineer. */
"%@ to %@" = "%1$@ tielle %2$@";

/* No comment provided by engineer. */
"%d of %d" = "%1$d/%2$d";

/* No comment provided by engineer. */
"%li to %li" = "%1$li–%2$li";

/* No comment provided by engineer. */
"'item' parameter required" = "item-parametri vaaditaan";

/* No comment provided by engineer. */
"'portal' parameter required" = "portal-parametri vaaditaan";

/* No comment provided by engineer. */
"'tags' parameter required" = "tags-parametri vaaditaan";

/* No comment provided by engineer. */
"'title' parameter required" = "title-parametri vaaditaan";

/* No comment provided by engineer. */
"+/-" = "+/-";

/* No comment provided by engineer. */
"<No value>" = "<Ei arvoa>";

/* No comment provided by engineer. */
"Access to the device location is denied." = "Laitteen sijainnin käyttö on estetty.";

/* No comment provided by engineer. */
"Actual Size" = "Todellinen koko";

/* No comment provided by engineer. */
"Add" = "Lisää";

/* No comment provided by engineer. */
"Add Attachment" = "Lisää liite";

/* No comment provided by engineer. */
"Add..." = "Lisää....";

/* No comment provided by engineer. */
"An itemID is required for this operation. Add this item to the Portal to get an ItemID." = "Tämä toiminto edellyttää itemID-tunnusta. Hanki ItemID-tunnus lisäämällä tämä kohde portaaliin.";

/* No comment provided by engineer. */
"An uncaught NSException was detected, however the original information and callstack is not available. Break on objective-c exceptions to see the line of code causing the original NSException. For more information on how to do this please see the documentation." = "Aiemmin havaitsematon NSException-poikkeus havaittiin, mutta alkuperäiset tiedot ja kutsupino eivät ole käytettävissä. Katkaise objective-c-poikkeusten kohdalla, jos haluat nähdä alkuperäisen NSException-poikkeuksen aiheuttavan koodirivin. Lisätietoja siitä, miten voit tehdä tämän, on dokumentaatiossa.";

/* No comment provided by engineer. */
"Apply Geometry" = "Käytä geometriaa";

/* No comment provided by engineer. */
"At least 1 facility is required to solve a route." = "Reitin selvitys edellyttää vähintään yhtä palvelua.";

/* No comment provided by engineer. */
"At least 1 incident is required to solve a route." = "Reitin selvitys edellyttää vähintään yhtä tapahtumaa.";

/* No comment provided by engineer. */
"At least 2 stops are required to solve a route." = "Reitin selvitys edellyttää vähintään kahta pysähdystä.";

/* No comment provided by engineer. */
"Attachment" = "Liite";

/* No comment provided by engineer. */
"Attachments" = "Liitteet";

/* No comment provided by engineer. */
"Attempt to use functionality that is not supported for the current license level" = "On yritetty käyttää toimintoa, jota nykyinen lisenssitaso ei tue";

/* No comment provided by engineer. */
"Authorization required" = "Todennus vaaditaan";

/* No comment provided by engineer. */
"Bad Request" = "Virheellinen pyyntö";

/* No comment provided by engineer. */
"Bad URL." = "Virheellinen URL.";

/* No comment provided by engineer. */
"bytes" = "tavua";

/* No comment provided by engineer. */
"Cancel" = "Peruuta";

/* No comment provided by engineer. */
"Cannot save to a different item type." = "Ei voi tallentaa eri kohdetyyppiin.";

/* No comment provided by engineer. */
"Cannot verify the identity of '%@'" = "Kohteen %@ tunnistetietoja ei voi todentaa";

/* No comment provided by engineer. */
"Certificate Required" = "Varmenne vaaditaan";

/* No comment provided by engineer. */
"Challenge for URL: %@ with failureCount: %lu" = "URL-osoitteen haaste: %1$@ with failureCount: %2$lu";

/* No comment provided by engineer. */
"Changing Feature Type" = "Vaihdetaan kohdetyyppiä";

/* No comment provided by engineer. */
"Choose From Library" = "Valitse kirjastosta";

/* No comment provided by engineer. */
"Clear" = "Tyhjennä";

/* No comment provided by engineer. */
"Clear Geometry" = "Tyhjennä geometria";

/* No comment provided by engineer. */
"Continue" = "Jatka";

/* No comment provided by engineer. */
"Created %d hours ago" = "Luotu %d tuntia sitten";

/* No comment provided by engineer. */
"Created %d minutes ago" = "Luotu %d minuuttia sitten";

/* No comment provided by engineer. */
"Created a minute ago" = "Luotu minuuttia sitten";

/* No comment provided by engineer. */
"Created an hour ago" = "Luotu tunti sitten";

/* No comment provided by engineer. */
"Created by %@" = "Luonut %@";

/* No comment provided by engineer. */
"Created by %@ %d hours ago" = "Luonut %1$@, %2$d tuntia sitten";

/* No comment provided by engineer. */
"Created by %@ %d minutes ago" = "Luonut %1$@, %2$d minuuttia sitten";

/* No comment provided by engineer. */
"Created by %@ a minute ago" = "Luonut %@, minuutti sitten";

/* No comment provided by engineer. */
"Created by %@ an hour ago" = "Luonut %@, tunti sitten";

/* No comment provided by engineer. */
"Created by %@ on %@ at %@ - day" = "Luonut %1$@, %2$@ klo %3$@ – päivä";

/* No comment provided by engineer. */
"Created by %@ on %@ at %@ - full" = "Luonut %1$@, %2$@ klo %3$@ – täysi";

/* No comment provided by engineer. */
"Created by %@ seconds ago" = "Luonut %@, sekunteja sitten";

/* No comment provided by engineer. */
"Created on %@ at %@ - day" = "Luotu %1$@ klo %2$@ – päivä";

/* No comment provided by engineer. */
"Created on %@ at %@ - full" = "Luotu %1$@ klo %2$@ – täysi";

/* No comment provided by engineer. */
"Created seconds ago" = "Luotu sekuntia sitten";

/* No comment provided by engineer. */
"Credential Required" = "Tunnistetiedot vaaditaan";

/* No comment provided by engineer. */
"Data for pie chart is invalid" = "Piirakkakaavion tiedot eivät kelpaa";

/* No comment provided by engineer. */
"Delete" = "Poista";

/* No comment provided by engineer. */
"Delete Attachment" = "Poista liite";

/* No comment provided by engineer. */
"Delete Feature" = "Poista kohde";

/* No comment provided by engineer. */
"Deleting this attachment will remove it from the popup and associated data source." = "Tämän liitteen poistaminen poistaa sen ponnahdusikkunasta ja siihen liittyvästä aineistolähteestä.";

/* No comment provided by engineer. */
"Deleting this feature will remove it from the map and associated data source." = "Tämän kohteen poistaminen poistaa sen kartasta ja siihen liittyvästä aineistolähteestä.";

/* No comment provided by engineer. */
"Directions time and distance attributes do not match." = "Reittiohjeiden aika- ja etäisyysominaisuustiedot eivät täsmää.";

/* No comment provided by engineer. */
"Edit" = "Muokkaa";

/* No comment provided by engineer. */
"Edited %d hours ago" = "Muokattu %d tuntia sitten";

/* No comment provided by engineer. */
"Edited %d minutes ago" = "Muokattu %d minuuttia sitten";

/* No comment provided by engineer. */
"Edited a minute ago" = "Muokattu minuuttia sitten";

/* No comment provided by engineer. */
"Edited an hour ago" = "Muokattu tunti sitten";

/* No comment provided by engineer. */
"Edited by %@" = "Muokannut %@";

/* No comment provided by engineer. */
"Edited by %@ %d hours ago" = "Muokannut %1$@, %2$d tuntia sitten";

/* No comment provided by engineer. */
"Edited by %@ %d minutes ago" = "Muokannut %1$@, %2$d minuuttia sitten";

/* No comment provided by engineer. */
"Edited by %@ a minute ago" = "Muokannut %@ minuutti sitten";

/* No comment provided by engineer. */
"Edited by %@ an hour ago" = "Muokannut %@, tunti sitten";

/* No comment provided by engineer. */
"Edited by %@ on %@ at %@ - day" = "Muokannut %1$@, %2$@ klo %3$@ – päivä";

/* No comment provided by engineer. */
"Edited by %@ on %@ at %@ - full" = "Muokannut %1$@, %2$@ klo %3$@ – täysi";

/* No comment provided by engineer. */
"Edited by %@ seconds ago" = "Muokannut %@, sekunteja sitten";

/* No comment provided by engineer. */
"Edited on %@ at %@ - day" = "Muokannut %1$@ klo %2$@ – päivä";

/* No comment provided by engineer. */
"Edited on %@ at %@ - full" = "Muokannut %1$@ klo %2$@ – täysi";

/* No comment provided by engineer. */
"Edited seconds ago" = "Muokattu sekuntia sitten";

/* No comment provided by engineer. */
"Empty username/password" = "Tyhjä käyttäjätunnus/salasana";

/* No comment provided by engineer. */
"Enter a date between %@ and %@" = "Anna päivämäärä väliltä %1$@ ja %2$@";

/* No comment provided by engineer. */
"Enter a number between %@ and %@" = "Kirjoita jokin numero %1$@–%2$@";

/* No comment provided by engineer. */
"Enter a number between %i and %i" = "Kirjoita jokin numero %1$i–%2$i";

/* No comment provided by engineer. */
"Error" = "Virhe";

/* No comment provided by engineer. */
"Error adding identity to the keychain" = "Virhe lisättäessä identiteettiä avainketjuun";

/* No comment provided by engineer. */
"Error adding keychain item" = "Virhe avainketjun kohteen lisäyksessä";

/* No comment provided by engineer. */
"Error extracting identity" = "Virhe haettaessa identiteettiä";

/* No comment provided by engineer. */
"Error Loading Page" = "Virhe sivun latauksessa";

/* No comment provided by engineer. */
"Error removing keychain item" = "Virhe avainketjun kohteen poistossa";

/* No comment provided by engineer. */
"Error updating keychain item" = "Virhe avainketjun kohteen päivityksessä";

/* No comment provided by engineer. */
"Exceeds maximum value (%@)" = "Ylittää enimmäisarvon (%@)";

/* No comment provided by engineer. */
"Extra Large" = "Erittäin suuri";

/* No comment provided by engineer. */
"Facility (%1$@) has invalid added cost attribute names (%2$@)." = "Palveluun (%1$@) on lisätty virheellisiä kustannusominaisuustietojen nimiä (%2$@).";

/* No comment provided by engineer. */
"Facility (%1$@) has negative added cost attribute (%2$@)." = "Palveluun (%1$@) on lisätty negatiivinen kustannusominaisuustieto (%2$@).";

/* No comment provided by engineer. */
"Feature isn't valid." = "Kohde ei kelpaa.";

/* No comment provided by engineer. */
"Finish" = "Valmis";

/* No comment provided by engineer. */
"Finishing editing..." = "Lopetetaan muokkausta...";

/* No comment provided by engineer. */
"GB" = "Gt";

/* No comment provided by engineer. */
"Geometry" = "Geometria";

/* No comment provided by engineer. */
"Hide" = "Piilota";

/* No comment provided by engineer. */
"Incident (%1$@) has invalid added cost attribute names (%2$@)." = "Tapahtumaan (%1$@) on lisätty virheellisiä kustannusominaisuustietojen nimiä (%2$@).";

/* No comment provided by engineer. */
"Incident (%1$@) has negative added cost attribute (%2$@)." = "Tapahtumaan (%1$@) on lisätty negatiivinen kustannusominaisuustieto (%2$@).";

/* No comment provided by engineer. */
"Insert Part" = "Lisää osa";

/* No comment provided by engineer. */
"Insert Vertex" = "Lisää taitepiste";

/* No comment provided by engineer. */
"Invalid argument." = "Virheellinen argumentti.";

/* No comment provided by engineer. */
"Invalid Credentials" = "Virheelliset tunnukset";

/* No comment provided by engineer. */
"Invalid GPX data." = "Virheellinen GPX-aineisto.";

/* No comment provided by engineer. */
"Invalid groupID." = "Virheellinen ryhmätunnus.";

/* No comment provided by engineer. */
"Joining this organization is supported by invitation only, you need to receive an invitation from the administrator" = "Tähän organisaatioon voi liittyä vain kutsusta. Järjestelmänvalvojan on lähetettävä sinulle kutsu";

/* No comment provided by engineer. */
"KB" = "kt";

/* No comment provided by engineer. */
"Keep Current Values" = "Säilytä nykyiset arvot";

/* No comment provided by engineer. */
"Large" = "Suuri";

/* No comment provided by engineer. */
"Less than minimum value (%@)" = "Pienempi kuin vähimmäisarvo (%@)";

/* No comment provided by engineer. */
"Licensed for Developer Use Only" = "Lisensoitu vain kehittäjäkäyttöön";

/* No comment provided by engineer. */
"Loading feature..." = "Ladataan kohdetta...";

/* No comment provided by engineer. */
"Map contains data that cannot be saved. To save this map, which will remove this data, pass true for forceSaveToSupportedVersion." = "Kartassa on aineistoa, jota ei voi tallentaa. Jos haluat tallentaa kartan, jolloin tämä aineisto poistetaan, sinun on määritettävä arvo Tosi parametrille forceSaveToSupportedVersion.";

/* No comment provided by engineer. */
"MB" = "Mt";

/* No comment provided by engineer. */
"Medium" = "Keskisuuri";

/* No comment provided by engineer. */
"Missing client certificate" = "Asiakasvarmenne puuttuu";

/* string to represent hyperlink attributes */
"More Info" = "Lisätietoja";

/* No comment provided by engineer. */
"Move Geometry" = "Siirrä geometria";

/* No comment provided by engineer. */
"Move Part" = "Siirrä osa";

/* No comment provided by engineer. */
"Move Vertex" = "Siirrä taitepiste";

/* No comment provided by engineer. */
"No certificate found to access the resource '%@'" = "Resurssin %@ käyttöön tarvittavaa varmennetta ei löydy";

/* No comment provided by engineer. */
"No data to create a bar chart" = "Ei tietoja palkkikaavion luomiseen";

/* No comment provided by engineer. */
"No data to create a line chart" = "Ei tietoja viivakaavion luomiseen";

/* No comment provided by engineer. */
"No data to create a pie chart" = "Ei tietoja piirakkakaavion luomiseen";

/* No comment provided by engineer. */
"No image to display" = "Yhtään näytettävää kuvaa ei ole";

/* No comment provided by engineer. */
"No path can be found between a given pair of stops (%@)." = "Annetun kohdeparin välille ei löydy polkua (%@).";

/* No comment provided by engineer. */
"Not a valid number" = "Numero ei kelpaa";

/* No comment provided by engineer. */
"Not a valid whole number" = "Kokonaisnumero ei kelpaa";

/* No comment provided by engineer. */
"Object cannot be created without a portal.  Use fromJSON:withPortal:error: method instead." = "Objektia ei voi luoda ilman portaalia. Käytä sen sijaan metodia fromJSON:withPortal:error:.";

/* No comment provided by engineer. */
"OK" = "OK";

/* No comment provided by engineer. */
"One or more accumulate attribute names (%@) are invalid." = "Vähintään yhden kumulatiivisen ominaisuustiedon nimi (%@) on virheellinen.";

/* No comment provided by engineer. */
"One or more attribute names (%@) associated with the custom parameter attribute values are invalid." = "Vähintään yhden muokatun parametrin ominaisuustietoarvoihin liitetyn ominaisuustiedon nimi (%@) on virheellinen.";

/* No comment provided by engineer. */
"One or more facilities (%@) have a null geometry." = "Vähintään yhdellä palvelulla (%@) on tyhjäarvoinen geometria.";

/* No comment provided by engineer. */
"One or more facilities (%@) have an invalid curb approach." = "Vähintään yhdellä palvelulla (%@) on virheellinen lähestymis- ja poistumispuoli.";

/* No comment provided by engineer. */
"One or more facilities (%@) have invalid impedance cutoff." = "Vähintään yhdellä palvelulla (%@) on virheellinen impedanssin raja.";

/* No comment provided by engineer. */
"One or more incidents (%@) have a null geometry." = "Vähintään yhdellä tapahtumalla (%@) on tyhjäarvoinen geometria.";

/* No comment provided by engineer. */
"One or more incidents (%@) have an invalid curb approach." = "Vähintään yhdellä tapahtumalla (%@) on virheellinen lähestymis- ja poistumispuoli.";

/* No comment provided by engineer. */
"One or more incidents (%@) have invalid impedance cutoff." = "Vähintään yhdellä tapahtumalla (%@) on virheellinen impedanssin raja.";

/* No comment provided by engineer. */
"One or more incidents (%@) have less than 1 target facility count." = "Vähintään yhdellä tapahtumalla (%@) on kohdepalvelujen määrä alle 1.";

/* No comment provided by engineer. */
"One or more parameter names (%@) associated with the custom parameter attribute values are invalid." = "Vähintään yhden muokatun parametrin ominaisuustietoarvoihin liitetyn parametrin nimi (%@) on virheellinen.";

/* No comment provided by engineer. */
"One or more parameter value types associated with the custom parameter attribute values (%@) are invalid." = "Vähintään yhden muokatun parametrin ominaisuustietoarvoihin liitetyn parametriarvon tyyppi (%@) on virheellinen.";

/* No comment provided by engineer. */
"One or more point barriers (%@) are unlocated." = "Vähintään yhtä piste-estettä (%@) ei ole paikannettu.";

/* No comment provided by engineer. */
"One or more point barriers (%@) have a null geometry." = "Vähintään yhdellä piste-esteellä (%@) on tyhjäarvoinen geometria.";

/* No comment provided by engineer. */
"One or more point barriers (%@) have an invalid added cost attribute name." = "Vähintään yhdellä piste-esteellä (%@) on virheellinen lisätyn kustannusominaisuustiedon nimi.";

/* No comment provided by engineer. */
"One or more point barriers (%@) have an invalid curb approach." = "Vähintään yhdellä piste-esteellä (%@) on virheellinen lähestymis- ja poistumispuoli.";

/* No comment provided by engineer. */
"One or more polygon barriers (%@) does not cover any network elements." = "Vähintään yksi alue-este (%@) ei peitä yhtään verkon elementtiä.";

/* No comment provided by engineer. */
"One or more polygon barriers (%@) have a null geometry." = "Vähintään yhdellä alue-esteellä (%@) on tyhjäarvoinen geometria.";

/* No comment provided by engineer. */
"One or more polygon barriers (%@) have an invalid scaled cost attribute name." = "Vähintään yhdellä alue-esteellä (%@) on virheellinen skaalatun kustannusominaisuustiedon nimi.";

/* No comment provided by engineer. */
"One or more polyline barriers (%@) does not cover any network elements." = "Vähintään yksi moniviivaeste (%@) ei peitä yhtään verkon elementtiä.";

/* No comment provided by engineer. */
"One or more polyline barriers (%@) have a null geometry." = "Vähintään yhdellä moniviivaesteellä (%@) on tyhjäarvoinen geometria.";

/* No comment provided by engineer. */
"One or more polyline barriers (%@) have an invalid scaled cost attribute name." = "Vähintään yhdellä moniviivaesteellä (%@) on virheellinen skaalatun kustannusominaisuustiedon nimi.";

/* No comment provided by engineer. */
"One or more restriction attribute names (%@) are invalid." = "Vähintään yhden rajoituksen ominaisuustiedon nimi (%@) on virheellinen.";

/* No comment provided by engineer. */
"One or more restriction usage values (%1$@) associated with the custom parameter attribute values (%2$@) are invalid." = "Vähintään yksi muokatun parametrin ominaisuustietoarvoihin (%2$@) liitetty rajoituksen käyttöarvo (%1$@) on virheellinen.";

/* No comment provided by engineer. */
"One or more restriction usage values (%1$@) associated with the custom parameter attribute values ((%2$@) are neutral (i.e., have no effect)." = "Vähintään yksi muokatun parametrin ominaisuustietoarvoihin (%2$@) liitetty rajoituksen käyttöarvo (%1$@) on neutraali (eli sillä ei ole vaikutusta).";

/* No comment provided by engineer. */
"One or more stops (%@) are located on a non-traversable element." = "Pysähdys (%@) sijaitsee elementissä, jonka läpi ei voi kulkea.";

/* No comment provided by engineer. */
"One or more stops (%@) are located on a soft-restricted element." = "Vähintään yksi pysähdys (%@) sijaitsee pehmeän rajoituksen elementissä.";

/* No comment provided by engineer. */
"One or more stops (%@) are unlocated." = "Vähintään yhtä pysähdystä (%@) ei ole paikannettu.";

/* No comment provided by engineer. */
"One or more stops (%@) cannot be reached from other stops." = "Vähintään yhtä pysähdystä (%@) ei voi saavuttaa muista pysähdyksistä.";

/* No comment provided by engineer. */
"One or more stops (%@) have a null geometry." = "Vähintään yhdellä pysähdyksellä (%@) on tyhjäarvoinen geometria.";

/* No comment provided by engineer. */
"One or more stops (%@) have a time window end that occurs before its time window start." = "Vähintään yhden pysähdyksen (%@) aikaikkunan lopetus on ennen aikaikkunan aloitusta.";

/* No comment provided by engineer. */
"One or more stops (%@) have a time window that starts before January 1, 1970." = "Vähintään yhden pysähdyksen (%@) aikaikkuna alkaa ennen 1.1.1970.";

/* No comment provided by engineer. */
"One or more stops (%@) have an invalid curb approach." = "Vähintään yhdellä pysähdyksellä (%@) on virheellinen lähestymis- ja poistumispuoli.";

/* No comment provided by engineer. */
"Open in Safari" = "Avaa Safarissa";

/* No comment provided by engineer. */
"Password" = "Salasana";

/* No comment provided by engineer. */
"Please enter a name for the new attachment" = "Anna uuden liitteen nimi";

/* No comment provided by engineer. */
"Polygon barrier (%1$@) has negative or zero scaled cost attributes (%2$@)." = "Alue-esteellä (%1$@) on negatiivinen tai nolla-arvoinen skaalattu kustannusominaisuustieto (%2$@).";

/* No comment provided by engineer. */
"Polyline barrier (%1$@) has negative or zero scaled cost attributes (%2$@)." = "Moniviivaesteellä (%1$@) on negatiivinen tai nolla-arvoinen skaalattu kustannusominaisuustieto (%2$@).";

/* No comment provided by engineer. */
"Polylines cannot be returned." = "Taiteviivoja ei voi palauttaa.";

/* No comment provided by engineer. */
"Public Account user cannot access this application." = "Julkisen tilin käyttäjä ei voi käyttää tätä sovellusta.";

/* No comment provided by engineer. */
"Remove Part" = "Poista osa";

/* No comment provided by engineer. */
"Remove Vertex" = "Poista taitepiste";

/* No comment provided by engineer. */
"Reordering stops (Traveling Salesman Problem) is not supported when the collection of stops contains waypoints or rest breaks." = "Pysähdysten järjestämistä uudelleen (kiertävän myyntiedustajan ongelma) ei tueta, kun pysähdysten kerääminen sisältää väyläpisteitä tai taukoja.";

/* No comment provided by engineer. */
"Reset to Default Values" = "Palauta oletusarvoihin";

/* No comment provided by engineer. */
"Retry" = "Yritä uudelleen";

/* No comment provided by engineer. */
"Route starts or ends on a waypoint." = "Reitti alkaa väyläpisteestä tai päättyy siihen.";

/* No comment provided by engineer. */
"Save Image" = "Tallenna kuva";

/* No comment provided by engineer. */
"Save Movie" = "Tallenna elokuva";

/* No comment provided by engineer. */
"Sign In" = "Kirjaudu sisään";

/* No comment provided by engineer. */
"Skip" = "Ohita";

/* No comment provided by engineer. */
"Small" = "Pieni";

/* No comment provided by engineer. */
"Specified start time occurs before January 1, 1970." = "Määritetty aloitusaika on ennen 1.1.1970.";

/* No comment provided by engineer. */
"Stop (%1$@) has invalid added cost attribute names (%2$@)." = "Pysähdyksellä (%1$@) on virheellisiä lisättyjä kustannusominaisuustietojen nimiä (%2$@).";

/* No comment provided by engineer. */
"Take Photo or Video" = "Ota valokuva tai video";

/* No comment provided by engineer. */
"The default impedance cutoff is invalid." = "Impedanssin oletusraja on virheellinen.";

/* No comment provided by engineer. */
"The default target facility count is invalid." = "Oletuskohdepalvelujen määrä on virheellinen.";

/* No comment provided by engineer. */
"The directions distance attribute name (%@) is invalid." = "Reittiohjeiden etäisyyden ominaisuustiedon nimi (%@) on virheellinen.";

/* No comment provided by engineer. */
"The directions language is invalid." = "Reittiohjeiden kieli on virheellinen.";

/* No comment provided by engineer. */
"The directions road class attribute is invalid." = "Reittiohjeiden tieluokan ominaisuustieto on virheellinen.";

/* No comment provided by engineer. */
"The directions style is invalid." = "Reittiohjeiden tyyli on virheellinen.";

/* No comment provided by engineer. */
"The directions time attribute name (%@) is invalid." = "Reittiohjeiden ajan ominaisuustiedon nimi (%@) on virheellinen.";

/* No comment provided by engineer. */
"The impedance attribute name (%@) is invalid." = "Impedanssin ominaisuustiedon nimi (%@) on virheellinen.";

/* No comment provided by engineer. */
"The input spatial reference is undefined." = "Lähtökoordinaatistotietoja ei ole määritetty.";

/* No comment provided by engineer. */
"The network does not have a hierarchy attribute for performing hierarchical route planning." = "Verkossa ei ole hierarkiaominaisuustietoa hierarkkista reittisuunnittelua varten.";

/* No comment provided by engineer. */
"The object must first be saved to a portal using the 'saveAs:' method." = "Objekti on tallennettava ensin portaaliin metodilla saveAs:.";

/* No comment provided by engineer. */
"The output spatial reference is undefined." = "Tuloskoordinaatistotietoja ei ole määritetty.";

/* No comment provided by engineer. */
"The polygon buffer distance is invalid." = "Aluepuskurin etäisyys on virheellinen.";

/* No comment provided by engineer. */
"The resource you are looking for might have been removed, had its name changed, or is temporarily unavailable" = "Etsimäsi resurssi on saatettu poistaa, resurssin nimi on saatettu vaihtaa tai resurssi on väliaikaisesti poissa käytöstä";

/* No comment provided by engineer. */
"The resulting route has traversed one or more soft-restricted elements (%@)." = "Tuloksena olevalla reitillä on vähintään yksi läpi kuljettu, pehmeän rajoituksen elementti (%@).";

/* No comment provided by engineer. */
"The route is too large to solve using the walking travel mode." = "Reitti on liian suuri, jotta sen voi ratkaista kävelymatkustustilan avulla.";

/* No comment provided by engineer. */
"The search where clause is not supported." = "Haun where-lauseketta ei tueta.";

/* No comment provided by engineer. */
"The server’s certificate is invalid. You might be connecting to a server that is pretending to be '%@', which could put your confidential information at risk. Would you like to connect anyway?" = "Palvelinsertifikaatti on virheellinen. Olet ehkä muodostamassa yhteyttä palvelimeen, joka väittää olevansa %@. Tämä voi vaarantaa luottamukselliset tietosi. Haluatko silti muodostaa yhteyden?";

/* No comment provided by engineer. */
"The service cannot properly calculate time shift." = "Palvelu ei voi laskea aikasiirtymää oikein.";

/* No comment provided by engineer. */
"The specified clientID is invalid" = "Määritetty työasematunnus on virheellinen";

/* No comment provided by engineer. */
"The stop type property was ignored for stops (%@) because the server does not support selected type of stop." = "Pysähdysten tyypin ominaisuus ohitettiin (%@), koska palvelin ei tue valittua pysähdyksen tyyppiä.";

/* No comment provided by engineer. */
"The travel mode has been set to default." = "Matkustustilaksi on määritetty oletustila.";

/* No comment provided by engineer. */
"The waypoints (%@) contain added cost attribute." = "Väyläpisteet (%@) sisältävät lisätyn kustannusominaisuustiedon.";

/* No comment provided by engineer. */
"The waypoints (%@) contain time windows." = "Väyläpisteet (%@) sisältävät aikaikkunoita.";

/* No comment provided by engineer. */
"There was an error loading the feature. Please check your network connectivity." = "Kohteen latauksessa on ilmennyt virhe. Tarkista verkkoyhteytesi.";

/* No comment provided by engineer. */
"Time windows start date was changed." = "Aikaikkunoiden aloitusaikaa muutettiin.";

/* No comment provided by engineer. */
"Time windows were ignored because the impedance attribute is not time based." = "Aikaikkunat ohitettiin, koska impedanssin ominaisuustieto ei perustu aikaan.";

/* No comment provided by engineer. */
"To save as a new item, you must be logged in to the portal." = "Jotta voit tallentaa kohteen uutena kohteena, sinun on kirjauduttava portaaliin.";

/* No comment provided by engineer. */
"Today" = "Tänään";

/* No comment provided by engineer. */
"Token is invalid or has expired" = "Tunnus on väärä tai on vanhentunut";

/* No comment provided by engineer. */
"Token URL is nil. You must set a valid token URL on the credential." = "Tunnuksen URL on tyhjä. Määritä varmenteeseen kelvollinen tunnuksen URL.";

/* No comment provided by engineer. */
"Unable to login with provided credentials." = "Kirjautuminen annetuilla tunnistetiedoilla ei onnistu.";

/* No comment provided by engineer. */
"Unable to retrieve user profile from the provider" = "Käyttäjäprofiilin nouto palvelusta ei onnistu";

/* No comment provided by engineer. */
"Unauthorized access" = "Luvaton käyttö";

/* No comment provided by engineer. */
"Unknown authentication error" = "Tuntematon todennusvirhe";

/* No comment provided by engineer. */
"Unknown condition." = "Tuntematon ehto.";

/* No comment provided by engineer. */
"Unknown error occurred" = "Tuntematon virhe";

/* No comment provided by engineer. */
"Unsupported GPX data." = "GPX-aineistoa ei tueta.";

/* No comment provided by engineer. */
"User canceled error" = "Käyttäjä peruutti -virhe";

/* No comment provided by engineer. */
"User licenses assigned by your organization are invalid. Please contact your administrator to adjust the license assignments and try again." = "Organisaatiosi määrittämät käyttäjälisenssit eivät kelpaa. Pyydä pääkäyttäjääsi muokkaamaan lisenssimäärityksiä ja yritä uudelleen.";

/* No comment provided by engineer. */
"Username" = "Käyttäjätunnus";

/* No comment provided by engineer. */
"Using browser to authenticate..." = "Käytetään selainta todentamiseen...";

/* No comment provided by engineer. */
"Value exceeds maximum field length of %lu" = "Arvo ylittää kentän enimmäispituuden, joka on %lu";

/* No comment provided by engineer. */
"You are changing the feature type. Would you like to keep your current values (where possible) or reset to defaults?" = "Olet muuttamassa kohteen tyyppiä. Haluatko säilyttää nykyiset arvot (jos mahdollista) vai palauttaa oletusarvot?";

/* No comment provided by engineer. */
"You cannot sign in because you do not have an organization account associated with your social network credentials" = "Et voi kirjautua sisään, koska organisaation tiliä ei ole liitetty yhteisöpalvelun tunnistetietoihisi";

/* No comment provided by engineer. */
"You do not have permissions to access this resource" = "Sinulla ei ole oikeuksia tämän resurssin käyttämiseen";

/* No comment provided by engineer. */
"You do not have sufficient user level to access this application." = "Käyttäjätasosi ei riitä tämän sovelluksen käyttöön.";

/* No comment provided by engineer. */
"You must be logged in to the Portal to perform this operation." = "Tämän toiminnon suorittaminen edellyttää portaaliin kirjautumista.";

/* No comment provided by engineer. */
"You must be specify a rating between 1 and 5." = "Määritä arvioksi 1–5.";

/* No comment provided by engineer. */
"You must specify a location usage description key (NSLocationWhenInUseUsageDescription or NSLocationAlwaysUsageDescription) in your plist." = "Määritä sijaintitietojen käytön kuvausavain (NSLocationWhenInUseUsageDescription tai NSLocationAlwaysUsageDescription) plist-tiedostoon.";

/* No comment provided by engineer. */
"You need to select a certificate to access the resource '%@'" = "Sinun on valittava varmenne, jotta voit käyttää resurssia %@";

/* No comment provided by engineer. */
"You need to sign in to access the resource '%@'" = "Sinun on kirjauduttava sisään, jotta voit käyttää resurssia %@";

/* No comment provided by engineer. */
"• " = "• ";

﻿/* Localizable+Additions.strings */

/* Unit Abbreviated strings */
"cm" = "cm";
"dd" = "dd";
"dm" = "dm";
"ft" = "ft";
"in" = "tuuma";
"km" = "km";
"m" = "m";
"mi" = "mi";
"mm" = "mm";
"nm" = "mpk";
"pt" = "pt";
"Unknown" = "Tuntematon";
"yd" = "yd";

/* Unit Display Strings */
"Centimeters" = "Senttimetriä";
"Decimal Degrees" = "Desimaaliastetta";
"Decimeters" = "Desimetriä";
"Feet" = "Jalkaa";
"Inches" = "Tuumaa";
"Kilometers" = "Kilometriä";
"Meters" = "Metriä";
"Miles" = "Mailia";
"Millimeters" = "Millimetriä";
"Nautical Miles" = "Meripeninkulmaa";
"Points" = "Pistettä";
"Yards" = "Jaardia";

/* Area Units Abbreviated Strings */
"sq. in" = "sq. in";
"sq. ft" = "sq. ft";
"sq. yd" = "sq. yd";
"ac" = "ac";
"sq. mi" = "sq. mi";
"sq. mm" = "mm2";
"sq. cm" = "cm2";
"sq. dm" = "dm2";
"sq. m" = "m2";
"ares" = "a";
"ha" = "ha";
"sq. km" = "km2";

/* Area Units Display Strings */
"Square Inches" = "Neliötuumaa";
"Square Feet" = "Neliöjalkaa";
"Square Yards" = "Neliöjaardia";
"Acres" = "Eekkeriä";
"Square Miles" = "Neliömailia";
"Square Millimeters" = "Neliömillimetriä";
"Square Centimeters" = "Neliösenttimetriä";
"Square Decimeters" = "Neliödesimetriä";
"Square Meters" = "Neliömetriä";
"Ares" = "Aaria";
"Hectares" = "Hehtaaria";
"Square Kilometers" = "Neliökilometriä";

